docs: upgrade repository to v1.67 Enterprise standards
